DR_EXPLAIN.namespace( 'DR_EXPLAIN.data_index' );
DR_EXPLAIN.data_index = {

	// index
	DREX_NODE_KEYWORDS: [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,2,7,4,13,11,3,9,13,8,10,11,9,7,30,32,15,3,25,33,13,21,22,14,16,35,31,29,17,27,13,22,21,20,14,5,24,29,17,31,5,34,12,13,28,21,22,14,20,24,1,6,27,31,17,29,6,1,26,23,28,16,32,30,27,4,12,4,27,13,18,34,24,5,36,6,27],
	DREX_NODE_KEYWORDS_START: [0,0,35,35,37,40,43,43,51,54,60,64,71,75,77,87,91,94,100,106,108], //length:= drex.nodes_count,
	DREX_NODE_KEYWORDS_END: [0,35,35,37,40,43,43,51,54,60,64,71,75,77,87,91,94,100,106,108,111], //length:= drex.nodes_count,

	DREX_KEYWORD_NAMES: ["<NEW KEYWORD>","Абонемент","Акаунт адміністратора","Акаунт клієнта","Акаунт тренера","Активний підопічний","Активний тренер","Вікно адміністратора","Вікно входу","Вікно клієнта","Вікно реєстрації","Вікно тренера","Графік роботи тренера","Домашня сторінка","Кнопка виходу з акаунта","Кнопка входу в акаунт","Кнопка для створення акаунта для тренера","Кнопка для надсилання повідомлення","Кнопка для створення графіку","Кнопка переходу до вікна реєстрації","Кнопка переходу до профілю","Кнопка переходу на домашню сторінку","Кнопка переходу на сторінку чату","Кнопка придбання абонементу","Панель розкладу тренувань","Кнопка створення акаунта","Панель абонементів","Панель тренерів","Поле вводу ім’я","Панель чату","Поле вводу пароля","Поле вводу повідомлення","Поле вводу пошти","Поле підтвердження пароля","Профіль тренера","Статистика клубу","Доступний тренер"],
	DREX_KEYWORD_CHILD_START: [1,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37],
	DREX_KEYWORD_CHILD_END: [37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37,37]
	
};